#!/usr/bin/python3

print("""
 __ __    ___  _      _       ___          __    __   ___   ____   _      ___    __ 
|  |  |  /  _]| |    | |     /   \        |  |__|  | /   \ |    \ | |    |   \  |  |
|  |  | /  [_ | |    | |    |     | _____ |  |  |  ||     ||  D  )| |    |    \ |  |
|  _  ||    _]| |___ | |___ |  O  ||     ||  |  |  ||  O  ||    / | |___ |  D  ||__|
|  |  ||   [_ |     ||     ||     ||_____||  `  '  ||     ||    \ |     ||     | __ 
|  |  ||     ||     ||     ||     |        \      / |     ||  .  \|     ||     ||  |
|__|__||_____||_____||_____| \___/          \_/\_/   \___/ |__|\_||_____||_____||__|
""")
print('-' * 85)

#Formatação de string dentro de uma mensagem utilizando Chaves
nome = input('Olá, qual seu nome? ')
print('Seja bem vindo, {}'.format(nome))